package baseball

fun main() {
    TODO("프로그램 구현")
    /**
     * 기능목록
     * 1. 게임 시작 문구 출력
     * 2. 랜덤 한 숫자를 생성해 리스트에 저장
     * 3. 숫자 입력 문구 출력
     * 4. 숫자 입력 받음
     * 5. 예외처리 및 프로그램 종료
     * 6. 입력 받은 숫자를 잘라서 리스트에 보관
     * 7. 생성한 숫자와 입력받은 숫자가 동일한 숫자를 포함하고 있는지 확인
     * 8. 생성한 숫자와 입력받은 숫자가 동일하며 위치도 같은지 확인
     * 9. 확인 결과 출력
     * 10. 확인 결과가 3스트라이크 아닐경우 3번으로 돌아감
     * 11. 3스트라이크면 게임종료 텍스트 출력 및 게임 재시작 혹은 종료 출력
     * 12. 예외처리 및 프로그램 종료
     * 13. 재시작을 누르면 2번으로 복귀
     * 14. 종료를 누르면 프로그램 종료
     * */
}
